<?



$array = [1, 5, 3, 5, 6, 7, 8, 9, 25, 24, 18, 26, 27, 2, 29, 30, 31, 1, 2, 4, 2, 3, 4, 1, 2, 5, 3, 8, 4, 3, 9, 27, 21, 15, 14, 19, 44, 18, 22, 10, 1, 4, 43, 91, 9, 6, 9
, 66, 44, 76, 54, 84, 46, 61, 34, 57, 81, 49, 51, 34, 65, 75, 35, 39, 89, 91, 96, 34, 51, 20, 41, 31, 111, 22, 41, 223, 221, 44, 58, 91, 90, 43, 133, 411, 433, 612, 334, 31, 32, 57, 52, 79, 
70, 60, 40, 41, 57, 51, 44, 99];

$b = [];
sort($array); #Исключительно для удобства
 
foreach($array as $v)
{
    $b[$v][]=$v; #Создаем массив, где повторяющиеся элементы будут попадать в один общий массив

}
 

foreach($b as $k => $v){

    if (count($v) > 1) {
        $x[] = $k;
    }
        

}

    print_r($x);

   
